# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "domt4/autoupdate"

# Binaries
brew "automake"
brew "autoconf"
brew "bash" # Bash 4
brew "coreutils" # Those that come with macOS are outdated
brew "ack"
brew "zlib"
brew "sqlite"
brew "git"
brew "git-lfs"
brew "gnupg2"
brew "grep"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "mas"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash"
brew "tree"
brew "zsh"
brew "zsh-completions"
brew "openssl"
brew "libyaml"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "neovim"
brew "watchman"
brew "kubectl"
brew "kubernetes-helm"
brew "jq"
brew "cmake"
brew "diff-so-fancy"
brew "wxmac"
brew "hh"
brew "asdf"
brew "httpie"
brew "shellcheck"
brew "tflint"

# GitHub
brew "hub"

# AWS
brew "awscli"

# Image manipulation
brew "imagemagick"

# Apps
cask "aws-vault"
cask "alfred"
cask "arq"
cask "google-chrome"
cask "docker"
cask "skype"
cask "slack"
cask "spotify"
cask "spectacle"
cask "flux"
cask "iterm2"
cask "github"
cask "visual-studio-code"
cask "istat-menus"
cask "little-snitch"
cask "1password"
cask "1password-cli"
cask "dash"
cask "grammarly"
cask "google-drive-file-stream"
cask "macdown"
cask "monodraw"
cask "inkdrop"
cask "postman"
cask "cleanmymac"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"

# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-fira-code"
cask "font-hasklig"

# Mac App Store
mas "The Unarchiver", id: 425424353
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
