# Taps
tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/services"
tap "heroku/brew"

# Binaries
brew "automake"
brew "autoconf"
brew "bash" # Bash 4
brew "coreutils" # Those that come with macOS are outdated
brew "zlib"
brew "sqlite"
brew "git"
brew "git-lfs"
brew "gnupg2"
brew "grep"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "mackup"
brew "mas"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash"
brew "tree"
brew "zsh"
brew "zsh-completions"
brew "openssl"
brew "libyaml"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "neovim"
brew "watchman"
brew "kubectl"
brew "kubernetes-helm"
brew "wget"
brew "jq"
brew "cmake"

# Heroku
brew "heroku"

# Rails dependencies
brew "postgresql"

# GitHub
brew "hub"

# AWS
brew "awscli"

# Image manipulation
brew "imagemagick"

# Apps
cask "alfred"
cask "google-chrome"
cask "google-chrome-canary"
cask "docker"
cask "skype"
cask "slack"
cask "spotify"
cask "spectacle"
cask "flux"
cask "iterm2"
cask "tower2"
cask "visual-studio-code"
cask "virtualbox"
cask "google-cloud-sdk"
cask "minikube"
cask "istat-menus"
cask "little-snitch"
cask "1password"
cask "dash"
cask "grammarly"
cask 'google-drive-file-stream'

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "quicklook-csv"
cask "qlstephen"

# Fonts
cask "font-hack"
cask "font-iosevka"

# Mac App Store
mas "Bear", id: 1091189122
mas "The Unarchiver", id: 425424353
mas "Notability", id: 409183694
mas "WhatsApp", id: 1147396723
mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
